#### ElectricalLoadType Enumeration

---

|  |
| --- |
| See Also |

Represents the electrical load type.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public enum ElectricalLoadType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ElectricalLoadType ``` |

| Visual C++ |
| --- |
| ``` public enum class ElectricalLoadType ``` |

# Members

| Member name | Description |
| --- | --- |
| EquipmentLoad | Equipment Load |
| AreaBasedLoad | Area Based Load |

# See Also

Autodesk.Revit.DB.Electrical Namespace